[
  {
    "key": 1,
    "title": "Integrated Development Environment - IDE",
    "imageSrc": "IDE.png",
    "description": "A browser-based code playground that supports multiple programming languages, enabling users to write, run, and debug code in real-time. It features a modern editor with syntax highlighting (Monaco Editor), secure remote code execution, and a built-in file management system where users can create, rename, delete, and organize their code files and folders.",
    "go": "https://code-with-nj-integrated-development.vercel.app/"
  },
  {
    "key": 2,
    "title": "Hotel Management System",
    "imageSrc": "hotel.png",
    "description": "A web-based hotel room booking system designed to streamline the reservation process and manage room availability efficiently. The system allows users to view available rooms, make bookings, and receive confirmations. Developed using PHP for backend logic and HTML, CSS, and JavaScript for a responsive and user-friendly interface. The platform also integrates essential tech services to enhance the overall guest experience.",
    "go": "https://projects.evasoftaala.com/hotel/"
  },
  {
    "key": 3,
    "title": "A service Website",
    "imageSrc": "1.png",
    "description": "A responsive service-based website showcasing and managing various tech services offered to clients. Developed with PHP for dynamic content and backend logic, and HTML, CSS, and JavaScript for a clean, interactive front-end. The site allows users to explore services, submit inquiries, and connect with the support team—built to improve client engagement and service delivery.",
    "go": "https://www.evasoftaala.com/"
  },
  {
    "key": 4,
    "title": "Emotion Based music play",
    "imageSrc": "2.jpeg",
    "description": "A backend system that detects human emotions using facial expressions or audio cues and plays music that matches the detected mood. Developed using Python with machine learning and emotion recognition techniques, the system aims to personalize user experience by recommending or triggering music based on real-time emotional analysis.",
    "go": "https://github.com/Iamnishankjain/Emotion-based-music-play-system"
  },
  {
    "key": 5,
    "title": "Expense Tracker",
    "imageSrc": "3.png",
    "description": "A simple and efficient web application for tracking daily expenses, built during the GeeksForGeeks Hackathon. The system allows users to record, categorize, and view their expenses over time. Developed using PHP for backend logic with a clean and functional front-end, the app helps users manage their finances and stay within budget.",
    "go": "https://github.com/Iamnishankjain/ExpenseTracker"
  }
]
